Enterprise_Serivces/Prod/SilverGroup1/CSLAllSparkOrderService/result1/Iteration1/t4_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/AllSparkOrder/V1.0">ebab6a4d-4f04-4edb-9211-790a49e9de65</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/AllSparkOrder/V1.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/AllSparkOrder/V1.0/OrderService_v1/RetrieveOrder</wsa:Action><wsa:MessageID>uuid:4ee19763-c8cc-4882-91a9-3ac9a38015ee</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslallsparkorderserviceqa1.testgs.pvt/OrderService.svc</wsa:To></soap:Header><soap:Body><RetrieveOrderRequest xmlns="http://www.gamestop.com/CSL/AllSparkOrder/V1.0"><OrderRequestGUID>bde5c644-adf3-494d-a447-17cdd0a94e43</OrderRequestGUID><PartnerKey>TEST-US</PartnerKey></RetrieveOrderRequest></soap:Body></soap:Envelope>